{"0": {"Title": "Software Sales Representative", "Company": "Harvey Software, Inc.", "Description": "Job Description This is an inside software sales position. Employee will answer phone calls and email.. Major Responsibilities. Generate new business leads, develop relationships, conduct market analysis.."}, "1": {"Title": "Senior Software Engineer - Firmware Management", "Company": "NVIDIA", "Description": "We are looking for a Senior Software Engineer. Firmware Management.NVIDIAs invention of the GPU in 1999.. Hardware, Firmware, Dev Ops and QA teams. to deliver efficient, robust and scalable firmware lifecycle.."}, "2": {"Title": "C++ Software Engineer", "Company": "SS&C Technologies", "Description": "SS&C is a global provider of investment and financial services and software for the financial services.. Develop modular and scalable code for back end applications using C. , C .Co ordinate with Technical.."}, "3": {"Title": "Software Engineer II - Remote", "Company": "Akraya", "Description": "Primary Skills. Python, Pytest, CI CD, GitHub, Jenkin, Agile KanbanContract Type. W2Duration. 18 Months (100. Remote)Location. NC NOTE. Role open to Women Back to Work candidates w.."}, "4": {"Title": "Information Developer I", "Company": "Rocket Software", "Description": "Rocket Software is looking for a dynamic Information Developer I to join our vibrant, global content.. A fundamental principle of information security at Rocket Software is that all individuals in the.."}, "5": {"Title": "AWS Solutions Architect - Software Engineering", "Company": "ClearScale", "Description": "We architect, develop, and launch innovative and sophisticated solutions using the best cutting edge.. years experience building enterprise software solutions4. years of hands on experience working with AWS.."}, "6": {"Title": "Software Engineer", "Company": "Eze", "Description": "SS&C is a global provider of investment and financial services and software for the financial services.. You will fill a vital role in developing performant, scalable software product enhancements and.."}, "7": {"Title": "Software Project Manager III (Remote)", "Company": "EnerSys", "Description": "Job PurposeAs a Software Project Manager III you will be part of the Engineering team working on.. Experience with agile development methods (e.g. Scrum) and V cycle Proficient with Microsoft product.."}, "8": {"Title": "Associate Product Account Manager", "Company": "BMC Software", "Description": "BMC works with 86. of the Forbes Global 50 and customers and partners around the world to create their future. With our history of innovation, industry leading automation, operatio.."}, "9": {"Title": "Software Engineer (Remote Opportunity)", "Company": "Taylor Corporation", "Description": "The Taylor Healthcare Software Development team is looking for a Software Engineer to build healthcare.. Candidates must be flexible and willing to work in an agile development process. The ideal candidate.."}, "10": {"Title": "PLM Product Owner (Senior Advanced Software Engineer)", "Company": "Honeywell", "Description": "XSBG Alignment on detailed Requirements, User stories and develop process harmonization across the xSBG.. Has understanding of Software configuration management Align with business teams on the functional.."}, "11": {"Title": "Bus Operator", "Company": "RATP Dev", "Description": "General InformationJob Title Bus OperatorLocation 360 Haywood StreetAsheville, NC, 28801United StatesEmployee Type Non Exempt FTDescriptionDrivers wanted. Expanding service 18.06 t.."}, "12": {"Title": "Asheville Manufacturing Software and Applications Engineer - ONSITE", "Company": "Raytheon Technologies", "Description": "Are you ready to go beyond?We are seeking a highly motivated Manufacturing Software and Applications.. This includes all production and maintenance workers, as they are essential to the development of our.."}, "13": {"Title": "Software Developer", "Company": "Revature", "Description": "Looking for a career in technology while also continuing to advance your skills? Were looking for software engineers to join our team and work on projects that matter.With a wide range of.."}, "14": {"Title": "C++ Software Engineer - Remote", "Company": "iboss", "Description": "To learn more, visit. Job DescriptionAs a C. Software Engineer at iboss, you will have the opportunity.. There are many exciting projects on which to work. iboss software developers excel at solving tough.."}, "15": {"Title": "ServiceNow Software Engineer", "Company": "organón", "Description": "Support of Organon Agile DevOps toolsets to sustain agile ways of working.Education Minimum Requirements.. years experience in ServiceNow Development.ITIL Foundations Certification.Knowledge and experience with.."}, "16": {"Title": "Python Software Engineer", "Company": "Xperti", "Description": "Were searching for a Python Software Engineer with experience developing enterprise grade apps that are.. Job RequirementsMust Have 4 6 years of experience as a Java DeveloperAt least 5 years of experience in.."}, "17": {"Title": "JAVA/Python Software Developer) Jr. Level 100% Remote", "Company": "Us Staffing Adj, Inc", "Description": "Job title. JAVA Python Software Developer) Jr. Level 100. RemoteCompany. General DynamicsJob description.. No Suitability Required Public Trust Other Required. NACI (T1) Job Family. Software Development Job.."}, "18": {"Title": "Software Engineer - Remote Optional", "Company": "Hired", "Description": "Signup on Hired to find your dream job (remote work available) as a Software Engineer at one of 10,000.. Common ResponsibilitiesThe development and maintenance of client side and server side applications.."}, "19": {"Title": "Java Software Engineer - Mid Level", "Company": "USAA", "Description": "Purpose of JobWe are seeking a talented Java Software Engineer. Mid Level for our San Antonio, TX.. This person will be responsible for delivering development work items, peer reviewing others work items.."}, "20": {"Title": "E-mpower Program: Software Engineer", "Company": "BorgWarner", "Description": "Position(Software Engineer). BorgWarner Empower ProgramLocationArden, North CarolinaAbout usBorgWarner.. The program will offer your choice of specialization and development path,flexible working models, an.."}, "21": {"Title": "E-mpower Program: Software Engineer", "Company": "Sevcon", "Description": "Position(Software Engineer). BorgWarner Empower ProgramLocationArden, North CarolinaAbout usBorgWarner.. The program will offer your choice of specialization and development path,flexible working models, an.."}, "22": {"Title": "Software Engineer - Avionics", "Company": "Softworld Inc", "Description": "Title. Embedded Software Engineer Location. Black Mountain NC. onsite Duration. 12. months contract to.. Embedded software developer who can also do testing, understand the full architecture from coding in C.."}, "23": {"Title": "Software Architect - Avon, CT", "Company": "Hubell", "Description": "Duties and ResponsibilitiesPerform all aspects of software development. This includes specification.. Capably represent your development team in collaborations with other teams, program staff, and upper.."}}